Hi @yupwei68 
I used the 2.31.1 version and got the same error.
please check the below steps to replicate the issue.

i think you might have missed adding some files the directory ( i missed to mention it in my earlier comment)

1) create the following resources

```
 terraform apply -var-file=var.tfvars

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "australiaeast"
      + name     = "sharedeletest"
    }

  # azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                      = (known after apply)
      + account_kind                     = "StorageV2"
      + account_replication_type         = "LRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + large_file_share_enabled         = (known after apply)
      + location                         = "australiaeast"
      + min_tls_version                  = "TLS1_0"
      + name                             = "sharedeletest"
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = "sharedeletest"
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }
    }

  # azurerm_storage_share.storage_share will be created
  + resource "azurerm_storage_share" "storage_share" {
      + id                   = (known after apply)
      + name                 = "sharedeletest"
      + quota                = 50
      + resource_manager_id  = (known after apply)
      + storage_account_name = "sharedeletest"
      + url                  = (known after apply)
    }

  # azurerm_storage_share_directory.share_directory["config"] will be created
  + resource "azurerm_storage_share_directory" "share_directory" {
      + id                   = (known after apply)
      + name                 = "config"
      + share_name           = "sharedeletest"
      + storage_account_name = "sharedeletest"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_resource_group.rg: Creating...
azurerm_resource_group.rg: Creation complete after 2s [id=/subscriptions/sharedeletest-subcription/resourceGroups/sharedeletest]
azurerm_storage_account.storage_account: Creating...
azurerm_storage_account.storage_account: Still creating... [10s elapsed]
azurerm_storage_account.storage_account: Still creating... [20s elapsed]
azurerm_storage_account.storage_account: Creation complete after 30s [id=/subscriptions/sharedeletest-subcription/resourceGroups/sharedeletest/providers/Microsoft.Storage/storageAccounts/sharedeletest]
azurerm_storage_share.storage_share: Creating...
azurerm_storage_share.storage_share: Creation complete after 1s [id=https://sharedeletest.file.core.windows.net/sharedeletest]
azurerm_storage_share_directory.share_directory["config"]: Creating...
azurerm_storage_share_directory.share_directory["config"]: Still creating... [10s elapsed]
azurerm_storage_share_directory.share_directory["config"]: Still creating... [20s elapsed]
azurerm_storage_share_directory.share_directory["config"]: Still creating... [30s elapsed]
azurerm_storage_share_directory.share_directory["config"]: Still creating... [40s elapsed]
azurerm_storage_share_directory.share_directory["config"]: Creation complete after 41s [id=https://sharedeletest.file.core.windows.net/sharedeletest/config]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

2) upoad some files to config folder (`azurerm_storage_share_directory.share_directory["config"]: Creation complete after 41s`)

3) try to destroy the same

```
$ terraform destroy -var-file=var.tfvars

azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/sharedeletest-subcription/resourceGroups/sharedeletest]
azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/sharedeletest-subcription/resourceGroups/sharedeletest/providers/Microsoft.Storage/storageAccounts/sharedeletest]
azurerm_storage_share.storage_share: Refreshing state... [id=https://sharedeletest.file.core.windows.net/sharedeletest]
azurerm_storage_share_directory.share_directory["config"]: Refreshing state... [id=https://sharedeletest.file.core.windows.net/sharedeletest/config]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # azurerm_resource_group.rg will be destroyed
  - resource "azurerm_resource_group" "rg" {
      - id       = "/subscriptions/sharedeletest-subcription/resourceGroups/sharedeletest" -> null
      - location = "australiaeast" -> null
      - name     = "sharedeletest" -> null
      - tags     = {} -> null
    }

  # azurerm_storage_account.storage_account will be destroyed
  - resource "azurerm_storage_account" "storage_account" {
      - access_tier                    = "Hot" -> null
      - account_kind                   = "StorageV2" -> null
      - account_replication_type       = "LRS" -> null
      - account_tier                   = "Standard" -> null
      - allow_blob_public_access       = false -> null
      - enable_https_traffic_only      = true -> null
      - id                             = "/subscriptions/sharedeletest-subcription/resourceGroups/sharedeletest/providers/Microsoft.Storage/storageAccounts/sharedeletest" -> null
      - is_hns_enabled                 = false -> null
      - location                       = "australiaeast" -> null
      - min_tls_version                = "TLS1_0" -> null
      - name                           = "sharedeletest" -> null
      - primary_access_key             = (sensitive value)
      - primary_blob_connection_string = (sensitive value)
      - primary_blob_endpoint          = "https://sharedeletest.blob.core.windows.net/" -> null
      - primary_blob_host              = "sharedeletest.blob.core.windows.net" -> null
      - primary_connection_string      = (sensitive value)
      - primary_dfs_endpoint           = "https://sharedeletest.dfs.core.windows.net/" -> null
      - primary_dfs_host               = "sharedeletest.dfs.core.windows.net" -> null
      - primary_file_endpoint          = "https://sharedeletest.file.core.windows.net/" -> null
      - primary_file_host              = "sharedeletest.file.core.windows.net" -> null
      - primary_location               = "australiaeast" -> null
      - primary_queue_endpoint         = "https://sharedeletest.queue.core.windows.net/" -> null
      - primary_queue_host             = "sharedeletest.queue.core.windows.net" -> null
      - primary_table_endpoint         = "https://sharedeletest.table.core.windows.net/" -> null
      - primary_table_host             = "sharedeletest.table.core.windows.net" -> null
      - primary_web_endpoint           = "https://sharedeletest.z8.web.core.windows.net/" -> null
      - primary_web_host               = "sharedeletest.z8.web.core.windows.net" -> null
      - resource_group_name            = "sharedeletest" -> null
      - secondary_access_key           = (sensitive value)
      - secondary_connection_string    = (sensitive value)
      - tags                           = {} -> null

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {

          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }

          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }

          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }
    }

  # azurerm_storage_share.storage_share will be destroyed
  - resource "azurerm_storage_share" "storage_share" {
      - id                   = "https://sharedeletest.file.core.windows.net/sharedeletest" -> null
      - metadata             = {} -> null
      - name                 = "sharedeletest" -> null
      - quota                = 50 -> null
      - resource_manager_id  = "/subscriptions/sharedeletest-subcription/resourceGroups/sharedeletest/providers/Microsoft.Storage/storageAccounts/sharedeletest/fileServices/default/shares/sharedeletest" -> null
      - storage_account_name = "sharedeletest" -> null
      - url                  = "https://sharedeletest.file.core.windows.net/sharedeletest" -> null
    }

  # azurerm_storage_share_directory.share_directory["config"] will be destroyed
  - resource "azurerm_storage_share_directory" "share_directory" {
      - id                   = "https://sharedeletest.file.core.windows.net/sharedeletest/config" -> null
      - metadata             = {} -> null
      - name                 = "config" -> null
      - share_name           = "sharedeletest" -> null
      - storage_account_name = "sharedeletest" -> null
    }

Plan: 0 to add, 0 to change, 4 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

azurerm_storage_share_directory.share_directory["config"]: Destroying... [id=https://sharedeletest.file.core.windows.net/sharedeletest/config]

Error: Error deleting Storage Share "config" (File Share "sharedeletest" / Account "sharedeletest" / Resource Group "sharedeletest"): directories.Client#Delete: Failure sending request: StatusCode=409 -- Original Error: autorest/azure: Service returned an error. Status=<nil> Code="DirectoryNotEmpty" Message="The specified directory is not empty.\nRequestId:664d7e66-e01a-000f-5c36-a1ed91000000\nTime:2020-10-13T07:55:01.7833642Z"
```

Hope this helps